
/******************指针数组********************/
/************************************************************* 
指针数组: 里面存放的都是指针
    定义: char *arr[4]={"hello","world","TZ","EDU"}; 这里就是定义一个指针数组,每个元素都是一个char*类型的数组,这些指针指向的位置对应字符串的首地址
	使用:可以使用指针数组里面的指针来申请内存来内容,arr[0]=(char *)malloc(sizeof(char)*10);然后赋值,像一个指针申请内存后正常的使用

**************************************************************/

#include <stdio.h>
#include <stdlib.h>




int main()
{


	char *arr[4] = { "hello", "world", "TZ", "EDU" };
	//char *arr[0]="hello";

	printf("%s %s %s %s", arr[0], arr[1], arr[2], arr[3]);
	

	getchar();
	getchar();
	return 0;
}
